#ifndef EFI_H
#define EFI_H
#ifndef __cplusplus
#ifndef static_assert
#define static_assert _Static_assert
#endif
#define bool    unsigned char
#define true    1
#define false   0
#ifndef NULL
#define NULL ((void*)0)
#endif
#endif
#ifndef __weak
#define __weak __attribute__((weak))
#endif
#ifndef __used
#define __used __attribute__((used))
#endif
#ifndef __unused
#define __unused __attribute__((unused))
#endif
#ifndef __packed
#define __packed __attribute__((packed))
#endif
#define SWAP16(_v) ((((_v)&0xFF00)>>8)|(((_v)&0x00FF)<<8))
#define SWAP32(_v) SWAP16(((_v)&0xFFFF0000)>>16)|SWAP16((_v)&0x0000FFFF)
#define SWAP64(_v) SWAP32(((_v)&0xFFFFFFFF00000000)>>32)|SWAP32((_v)&0x00000000FFFFFFFF)
#ifndef MIN
#define MIN(a,b)({\
	typeof(a)_a=(a);\
	typeof(b)_b=(b);\
	(_b)>(_a)?(_a):(_b);\
})
#endif
#ifndef MAX
#define MAX(a,b)({\
	typeof(a)_a=(a);\
	typeof(b)_b=(b);\
	(_b)<(_a)?(_a):(_b);\
})
#endif
#define CHAR_MIN INT8_MIN
#define CHAR_MAX INT8_MAX
#define UCHAR_MAX UINT8_MAX
#define SHORT_MIN INT16_MIN
#define SHORT_MAX INT16_MAX
#define USHORT_MAX UINT16_MAX
#if __SIZEOF_INT__==4
#define INT_MIN INT32_MIN
#define INT_MAX INT32_MAX
#define UINT_MAX UINT32_MAX
#else
#error unknown int size
#endif
#if __SIZEOF_LONG__==4
#define LONG_MIN INT32_MIN
#define LONG_MAX INT32_MAX
#define ULONG_MAX UINT32_MAX
#elif __SIZEOF_LONG__==8
#define LONG_MIN INT64_MIN
#define LONG_MAX INT64_MAX
#define ULONG_MAX UINT64_MAX
#else
#error unknown long size
#endif
#if __SIZEOF_LONG_LONG__==8

#define EFI_MEMORY_UCE              0x0000000000000010ULL
#define EFI_MEMORY_WP               0x0000000000001000ULL
#define EFI_MEMORY_RP               0x0000000000002000ULL
#define EFI_MEMORY_XP               0x0000000000004000ULL
#define EFI_MEMORY_RO               0x0000000000020000ULL
#define EFI_MEMORY_NV               0x0000000000008000ULL
#define EFI_MEMORY_MORE_RELIABLE    0x0000000000010000ULL
#define EFI_MEMORY_SP               0x0000000000040000ULL
#define EFI_MEMORY_CPU_CRYPTO       0x0000000000080000ULL
#define EFI_MEMORY_RUNTIME          0x8000000000000000ULL
#define EFI_CACHE_ATTRIBUTE_MASK (EFI_MEMORY_UC | EFI_MEMORY_WC | EFI_MEMORY_WT | EFI_MEMORY_WB | EFI_MEMORY_UCE | EFI_MEMORY_WP)
#define EFI_MEMORY_ACCESS_MASK (EFI_MEMORY_RP | EFI_MEMORY_XP | EFI_MEMORY_RO)
#define EFI_MEMORY_ATTRIBUTE_MASK (EFI_MEMORY_ACCESS_MASK | EFI_MEMORY_SP | EFI_MEMORY_CPU_CRYPTO)
#define EFI_VARIABLE_NON_VOLATILE                            0x00000001
#define EFI_VARIABLE_BOOTSERVICE_ACCESS                      0x00000002
#define EFI_VARIABLE_RUNTIME_ACCESS                          0x00000004
#define EFI_VARIABLE_HARDWARE_ERROR_RECORD                   0x00000008
#define EFI_VARIABLE_TIME_BASED_AUTHENTICATED_WRITE_ACCESS   0x00000020
#define EFI_VARIABLE_APPEND_WRITE                            0x00000040
#define EFI_VARIABLE_AUTHENTICATED_WRITE_ACCESS              0x00000010
#define EFI_VARIABLE_ATTRIBUTE_NV_BS (EFI_VARIABLE_NON_VOLATILE | EFI_VARIABLE_BOOTSERVICE_ACCESS)
#define EFI_VARIABLE_ATTRIBUTE_BS_RT (EFI_VARIABLE_BOOTSERVICE_ACCESS | EFI_VARIABLE_RUNTIME_ACCESS)
#define EFI_VARIABLE_ATTRIBUTE_BS_RT_AT (VARIABLE_ATTRIBUTE_BS_RT | EFI_VARIABLE_TIME_BASED_AUTHENTICATED_WRITE_ACCESS)
#define EFI_VARIABLE_ATTRIBUTE_NV_BS_RT (VARIABLE_ATTRIBUTE_BS_RT | EFI_VARIABLE_NON_VOLATILE)
#define EFI_VARIABLE_ATTRIBUTE_NV_BS_RT_HR (VARIABLE_ATTRIBUTE_NV_BS_RT | EFI_VARIABLE_HARDWARE_ERROR_RECORD)
#define EFI_VARIABLE_ATTRIBUTE_NV_BS_RT_AT (VARIABLE_ATTRIBUTE_NV_BS_RT | EFI_VARIABLE_TIME_BASED_AUTHENTICATED_WRITE_ACCESS)
#define EFI_VARIABLE_ATTRIBUTE_AT EFI_VARIABLE_TIME_BASED_AUTHENTICATED_WRITE_ACCESS
#define EFI_VARIABLE_ATTRIBUTE_NV_BS_RT_HR_AT (VARIABLE_ATTRIBUTE_NV_BS_RT_HR | VARIABLE_ATTRIBUTE_AT)
#define EFI_VARIABLE_ATTRIBUTE_AT_AW (EFI_VARIABLE_TIME_BASED_AUTHENTICATED_WRITE_ACCESS | EFI_VARIABLE_AUTHENTICATED_WRITE_ACCESS)
#define EFI_VARIABLE_ATTRIBUTE_NV_BS_RT_AW (VARIABLE_ATTRIBUTE_NV_BS_RT | EFI_VARIABLE_AUTHENTICATED_WRITE_ACCESS)
#define EFI_VARIABLE_ATTRIBUTE_NV_BS_RT_HR_AT_AW (VARIABLE_ATTRIBUTE_NV_BS_RT_HR | VARIABLE_ATTRIBUTE_AT_AW)
#define EFI_VARIABLE_ATTRIBUTES_MASK (\
	EFI_VARIABLE_NON_VOLATILE|\
	EFI_VARIABLE_BOOTSERVICE_ACCESS|\
	EFI_VARIABLE_RUNTIME_ACCESS|\
	EFI_VARIABLE_HARDWARE_ERROR_RECORD|\
	EFI_VARIABLE_TIME_BASED_AUTHENTICATED_WRITE_ACCESS|\
	EFI_VARIABLE_APPEND_WRITE\
)
#if (defined(__GNUC__)&&__GNUC__>=4)||defined(__clang__)
#define offsetof(t,f) ((uintn_t)__builtin_offsetof(t,f))
#endif
#ifndef offsetof
#define offsetof(type,field)((uintn_t)&(((type*)0)->field))
#endif
typedef union{uint8_t v[sizeof(float)];float d;}float_t;
typedef union{uint8_t v[sizeof(double)];double d;}double_t;
typedef union{uint8_t v[sizeof(long double)];long double d;}longdouble_t;
static_assert(sizeof(float)==sizeof(float_t),"float_t mimatch");
static_assert(sizeof(double)==sizeof(double_t),"double_t mimatch");
static_assert(sizeof(long double)==sizeof(longdouble_t),"longdouble_t mimatch");
typedef uint16_t uchar16;
typedef uintn_t efi_tpl;
typedef uint64_t efi_lba;
typedef void*efi_event;
typedef void*efi_handle;
static_assert(sizeof(char8)==1,"char8 not 8-bits");
static_assert(sizeof(char16)==2,"char16 not 16-bits");
struct __packed_check{
	uint64_t a;
	uint8_t b;
	uint64_t c;
};
static_assert(sizeof(struct __packed_check)==24,"packed check failed");
typedef struct guid{
	uint32_t data1;
	uint16_t data2;
	uint16_t data3;
	uint8_t  data4[8];
}guid;
static_assert(sizeof(guid)==16,"efi guid size mismatch");
typedef struct efi_time{
	uint16_t year;
	uint8_t  month;
	uint8_t  day;
	uint8_t  hour;
	uint8_t  minute;
	uint8_t  second;
	uint8_t  pad1;
	uint32_t nanosecond;
	int16_t  timezone;
	uint8_t  daylight;
	uint8_t  pad2;
}efi_time;
static_assert(sizeof(efi_time)==16,"efi time size mismatch");
typedef struct efi_table_header{
	uint64_t sign;
	union{
		struct{
			uint16_t rev_minor;
			uint16_t rev_major;
		};
		uint32_t revision;
	};
	uint32_t header_size;
	uint32_t crc32;
	uint32_t reserved;
}efi_table_header;
static_assert(sizeof(efi_table_header)==24,"efi table header size mismatch");
typedef enum efi_memory_type{
	efi_reserved_memory_type,
	efi_loader_code,
	efi_loader_data,
	efi_bs_code,
	efi_bs_data,
	efi_rs_code,
	efi_rs_data,
	efi_conventional_memory,
	efi_unusable_memory,
	efi_acpi_reclaim_memory,
	efi_acpi_memory_nvs,
	efi_mmio,
	efi_mmio_port_space,
	efi_pal_code,
	efi_persistent_memory,
	efi_max_memory_type,
	efi_memory_type_max = UINT32_MAX,
}efi_memory_type;
typedef enum efi_allocate_type{
	allocate_any_pages,
	allocate_max_address,
	allocate_address,
	allocate_max
}efi_allocate_type;
typedef union efi_address{
	uint64_t  uint64;
	uintn_t   uintn;
	uintptr_t uintptr;
	intptr_t  intptr;
	void      *ptr;
}efi_address;
static_assert(sizeof(efi_address)==sizeof(uint64_t),"efi address size mismatch");
typedef struct efi_memory_descriptor{
	efi_memory_type type:32;
	efi_address     physical_start;
	efi_address     virtual_start;
	uint64_t        pages;
	uint64_t        attribute;
}efi_memory_descriptor;
static_assert(sizeof(efi_memory_descriptor)==40,"efi memory descriptor size mismatch");
typedef struct efi_mac_address{
	uint8_t addr[32];
}efi_mac_address;
typedef struct efi_ipv4_address{
	union{
		uint8_t addr[4];
		uint16_t u16[2];
		uint32_t u32[1];
		uint32_t raw;
	};
}efi_ipv4_address;
typedef struct efi_ipv6_address{
	union{
		uint8_t addr[16];
		uint16_t u16[8];
		uint32_t u32[4];
		uint64_t u64[2];
	};
}efi_ipv6_address;
typedef union efi_ip_address{
	uint32_t          addr[4];
	efi_ipv4_address  v4;
	efi_ipv6_address  v6;
}efi_ip_address;
#ifdef __UEFI_SPEC_H__
typedef EFI_GUID efi_guid;
#else
typedef guid efi_guid;
#endif
#ifndef EFI_SPECIFICATION_VERSION
#define EFI_2_80_REVISION ((2<<16)|(80))
#define EFI_2_70_REVISION ((2<<16)|(70))
#define EFI_2_60_REVISION ((2<<16)|(60))
#define EFI_2_50_REVISION ((2<<16)|(50))
#define EFI_2_40_REVISION ((2<<16)|(40))
#define EFI_2_31_REVISION ((2<<16)|(31))
#define EFI_2_30_REVISION ((2<<16)|(30))
#define EFI_2_20_REVISION ((2<<16)|(20))
